[
    {
        "cover": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/06/rogue-one-poster.jpg?q=50&fit=crop&w=680&h=400&dpr=1.5",
        "title": "\"I'd Do It Again If I Had A Time Machine\": Addresses",
        "description": "Gareth Edwards, the director of Rogue One: A Star Wars Story, has addressed behind-the-scenes drama of the Star Wars movie and has also shared his praises for George Lucas. Since the Disney acquisition, Lucasfilm has earned a reputation for behind the scenes drama; in the case of Rogue One, Tony Gilroy was brought on board to re-shoot Edwards' movie. Naturally, there's intense speculation about what really happened there. Uproxx took the opportunity of an interview with Edwards over his latest movie, The Creator, to ask about Star Wars. Despite all the rumors, Edwards gives an upbeat assessment of the joy of Star Wars, and praises the one person who made it all possible: George Lucas himself.",
        "date": "23 September, 2023",
        "author": "Colt Steele"
    },
    {
        "cover": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/08/jennifer-lawrence-as-katniss-in-the-hunger-games.jpg?q=50&fit=contain&w=767&h=&dpr=1.5",
        "title": "Hunger Games Returns To Theaters",
        "description": "The Hunger Games will be re-released in select theaters ahead of the franchise's upcoming prequel film, The Hunger Games: The Ballad of Songbirds & Snakes. The original films are based on the novel series by Suzanne Collins, chronicling Katniss Everdeen's time in the Hunger Games, a yearly battle between children in the nation of Panem. The upcoming prequel movie will reveal the origins of antagonist President Coriolanus Snow 64 years before Katniss' story. Now, Fathom Events has announced The Hunger Games will be returning to select theaters in anticipation of the prequel The Hunger Games: The Ballad of Songbirds & Snakes. Theaters across the US will be playing the original film on Sunday, October 15 and Wednesday, October 18 at 7:00 p.m. in local time zones. Tickets can be purchased at Fathom Events to relive the original movie on the big screen.",
        "date": "12 September, 2023",
        "author": "Angela Yu"
    },
    {
        "cover": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/09/harry-potter-ai-art-vietnam-war.jpg?q=50&fit=contain&w=767&h=&dpr=1.5",
        "title": "Harry Potter As A War Movie Art Is An Odd Waste",
        "description": "New Harry Potter AI art imagines key characters as soldiers in a gritty war, with even professor McGonagall taking up arms. Based on the beloved books by controversial author J.K. Rowling, the first film in the successful franchise was released in 2001. The movie introduces live-action versions of Harry, Ron, and Hermione, with a host of interesting supporting characters scattered throughout the eight-movie series. Now, AI-generated art shared by AI Dreams on Instagram takes Harry and other important Harry Potter characters and puts them in the middle of what appears to a conflict heavily inspired by the Vietnam War.",
        "date": "30 September, 2023",
        "author": "Nick Abidal"
    },
    {
        "cover": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/09/chris-pine-wearing-a-hate-and-long-hair-in-poolman.jpg?q=50&fit=contain&w=767&h=&dpr=1.5",
        "title": "Chris Pine's First Movie As A Director",
        "description": "Chris Pine's directorial debut, Poolman, disappoints critics. Poolman, in which Pine also stars as the lead, follows pool worker and would-be philosopher Darren Barrenman, who suddenly finds his day job at the Tahitian Tiki apartments. Things take an unexpected turn when he uncovers the greatest water heist in history. Poolman is co-written by Pine and Ian Gotler with the cast including Jennifer Jason Leigh, Annette Bening, Danny DeVito, and DeWanda Wise. Unfortunately, Pine's first foray as a director doesn't impress the critics. As of writing, Poolman has scored a rotten 11% Tomatometer on the popular aggregate site Rotten Tomatoes. This is only based on nine reviews, however, so the score could still fluctuate as more reviews get compiled. As of right now, this score marks his career-worst as the previous holder used to be his 2006 comedy Just My Luck, which had a 14%.",
        "date": "7 October, 2023",
        "author": "Lauren Blackwood"
    },
    {
        "cover": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/09/apelinq-transformers_-rise-of-the-beasts.jpg?q=50&fit=contain&w=767&h=&dpr=1.5",
        "title": "Transformers: Rise Of The Beasts Physical Release",
        "description": "Transformers: Rise of the Beasts' physical media release is coming up next month, and it will include alternate opening and ending scenes. Directed by Steven Caple Jr., the seventh installment in the live-action Transformers franchise hit theaters in June and recently became available on streaming. The sequel sees Optimus Prime and the Autobots (with two new human companions) racing to stop Unicron from destroying Earth. Now, per Collider, Transformers: Rise of the Beasts' physical release date is set for October 10. When the movie lands on 4K UHD, Blu-ray, and DVD, it will include a host of bonus features, including deleted scenes. Included among the deleted scenes is an alternate opening in which Optimus Prime faces off against Transit, a Decepticon, with the Transformers: Rise of the Beasts ending getting an alternate scene as well.",
        "date": "25 August, 2023",
        "author": "Adam Severance"
    },
    {
        "cover": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/09/kate-beckinsale-underworld.jpg?q=50&fit=contain&w=767&h=&dpr=1.5",
        "title": "\"She's...A Bit Fragile\": Kate Beckinsale",
        "description": "Underworld star Kate Beckinsale admits that she wasn't a natural when it came to being an action star, recalling how she prepared for her role as Selene. Released in 2003, Underworld stars Beckinsale as a vampire assassin who finds herself caught in a war between vampires and Lycans, a species of werewolf. Despite lackluster reviews from critics, the film would prove more popular with audiences, and Beckinsale would return as Selene for four sequels. In a recent interview with Yahoo! to celebrate Underworld's 20th anniversary, Beckinsale recalls having reservations about taking on the action-heavy role. While the physicality of playing a character like Selene was daunting at first, the actor clearly picked things up quite quickly.",
        "date": "12 August, 2023",
        "author": "Philip Jason"
    },
    {
        "cover": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/08/sound-of-freedom.jpg?q=50&fit=contain&w=767&h=&dpr=1.5",
        "title": "Sound Of Freedom's Real Life Inspiration",
        "description": "Sound of Freedom's real-life inspiration Tim Ballard, was reportedly the subject of sexual misconduct allegations and a related investigation. Directed by Alejandro Monteverde, the Angel Studios film serves as a loose adaptation of real events, chronicling Ballard's journey from government agent to vigilante as he embarks on a mission to end a child trafficking ring. Ballard founded Operation Underground Railroad (O.U.R.), an anti-child trafficking organization, in 2013, with controversial actor Jim Caviezel playing him in the film. Per a new report from Vice, Ballard was the subject of a sexual misconduct investigation conducted earlier this year. Ballard parted ways with O.U.R. this past June, and the latest report reveals that his departure followed allegations of sexual misconduct from seven women and a subsequent investigation. \"O.U.R. is dedicated to combatting sexual abuse, and does not tolerate sexual harassment or discrimination by anyone in its organization.\"",
        "date": "13 October, 2023",
        "author": "John McCarthy"
    }
]